tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "isen-ng/dotnet-sdk-versions"

brew "bat"
brew "cmake"
brew "colordiff"
brew "curl"
brew "deno"
brew "direnv"
brew "exa"
brew "fd"
brew "gawk"
brew "ghq"
brew "gibo"
brew "git"
brew "git-secrets"
brew "go"
brew "httpie"
brew "jid"
brew "jo"
brew "jq"
brew "kubernetes-cli"
brew "mas"
brew "mercurial"
brew "mergepbx"
brew "mysql"
brew "neovim"
brew "nkf"
brew "nmap"
brew "ossp-uuid"
brew "peco"
brew "remarshal"
brew "sqlite"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "z"
brew "zplug"
brew "zsh"

cask "alfred"
cask "appcleaner"
cask "caffeine"
cask "docker"
cask "firefox"
cask "gimp"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-japanese-ime"
cask "gyazo"
cask "inkdrop"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "onyx"
cask "qlmarkdown"
cask "sequel-pro"
cask "slack"
cask "spotify"
cask "visual-studio-code"

cask "font-camingocode"
cask "font-go"
cask "font-hackgen"
cask "font-jetbrains-mono"
cask "font-myricam"
cask "font-ricty-diminished"

mas "1Password 7", id: 1333542190
mas "CotEditor", id: 1024640650
mas "Magnet", id: 441258766
mas "MindNode", id: 1289197285
